[{"sentence":"All right, so let me try this again.","startTime":"00:00","endTime":"00:01"},{"sentence":"I want to do a quick review of Leora, so taking a look at this for the first time.","startTime":"00:01","endTime":"00:10"},{"sentence":"So here's some of my feedback.","startTime":"00:11","endTime":"00:12"},{"sentence":"This page.","startTime":"00:13","endTime":"00:14"},{"sentence":"So cool.","startTime":"00:14","endTime":"00:14"},{"sentence":"Such a cool technology to have.","startTime":"00:14","endTime":"00:16"},{"sentence":"This would be really great for salespeople to be able to search through and ask the tool, help them analyze and come up with what's important for them to be looking at.","startTime":"00:16","endTime":"00:29"},{"sentence":"At different times of the quarter, you know, different times of the week, they may be interested in different information.","startTime":"00:30","endTime":"00:37"},{"sentence":"And if they don't have the skill set to run spreadsheets and look at reports, I mean, this is the act for this.","startTime":"00:38","endTime":"00:46"},{"sentence":"So this was super smart.","startTime":"00:46","endTime":"00:47"},{"sentence":"Dashboard.","startTime":"00:48","endTime":"00:49"},{"sentence":"Love this.","startTime":"00:50","endTime":"00:51"},{"sentence":"The other thing that I would say is for metrics, it would be, I think a best practice to be able to choose and define the metrics.","startTime":"00:51","endTime":"00:59"},{"sentence":"So here's what an at risk customer means and have that definition published and be able to edit it.","startTime":"01:00","endTime":"01:09"},{"sentence":"And so over time, how we define an at risk customer may evolve.","startTime":"01:09","endTime":"01:15"},{"sentence":"Based on how we evolve as an organization, an at risk customer to well crafted in 2025 probably looks like somebody who hasn't ordered in a month.","startTime":"01:15","endTime":"01:25"},{"sentence":"In 2028, maybe it's somebody who hasn't ordered in a week.","startTime":"01:26","endTime":"01:30"},{"sentence":"So I think being able to have those inputs would be great.","startTime":"01:30","endTime":"01:35"},{"sentence":"The other thing I would say is if on the dashboard, if it's customizable, if there is an easy way for a rep to choose some reports instead of others.","startTime":"01:35","endTime":"01:49"},{"sentence":"So let's say there's like something on the bench where there's some report on the bench where the customer or the rep can say, I really want to see this particular report shown on my dashboard.","startTime":"01:50","endTime":"01:59"},{"sentence":"So I think fleshing that out and having a little bit of a customizable nature could be cool.","startTime":"02:00","endTime":"02:06"},{"sentence":"I'm just coming up with stuff that would be really nice to have.","startTime":"02:07","endTime":"02:11"},{"sentence":"Let's see.","startTime":"02:12","endTime":"02:13"},{"sentence":"Yeah, so stuff like this I contacted recently, what that means we would have to have the definitions for all of that insights.","startTime":"02:17","endTime":"02:25"},{"sentence":"So I think once this is up and running and we're using it, I think I'd have far more.","startTime":"02:27","endTime":"02:32"},{"sentence":"Hey, we should add this or we need to tweak this to this section.","startTime":"02:32","endTime":"02:38"},{"sentence":"But for now, I mean, this is unbelievable.","startTime":"02:38","endTime":"02:40"},{"sentence":"This section would be really valuable.","startTime":"02:40","endTime":"02:42"},{"sentence":"And then tasks for management here.","startTime":"02:43","endTime":"02:45"},{"sentence":"So this is really valuable.","startTime":"02:46","endTime":"02:48"},{"sentence":"In fact, I would probably have the tasks for management from management be like front and center.","startTime":"02:48","endTime":"02:52"},{"sentence":"So probably like right here.","startTime":"02:53","endTime":"02:55"},{"sentence":"So you have to look at them.","startTime":"02:56","endTime":"02:57"},{"sentence":"You can't just be like, oh, I didn't scroll down.","startTime":"02:57","endTime":"03:00"},{"sentence":"It's like, you know, you see key dashboard information and then boom, there's.","startTime":"03:00","endTime":"03:06"},{"sentence":"If you want to get to your customers, you've got to see what your manager is recommending to you first.","startTime":"03:06","endTime":"03:12"},{"sentence":"Customers.","startTime":"03:13","endTime":"03:14"},{"sentence":"Yep.","startTime":"03:14","endTime":"03:14"},{"sentence":"So this part isn't working, but this is a key piece.","startTime":"03:14","endTime":"03:18"},{"sentence":"What does this look like?","startTime":"03:19","endTime":"03:21"},{"sentence":"I think having the customer on a map and then all of the customer information different.","startTime":"03:21","endTime":"03:28"},{"sentence":"Like buyer cards.","startTime":"03:28","endTime":"03:30"},{"sentence":"I think it would be great if there was a way that you can take a picture of a business card and have it populate to the tools customer page just to reduce some of the manual entry.","startTime":"03:30","endTime":"03:42"},{"sentence":"Same thing.","startTime":"03:42","endTime":"03:43"},{"sentence":"If you could take a picture of, say, a rep is on site.","startTime":"03:43","endTime":"03:47"},{"sentence":"It's.","startTime":"03:47","endTime":"03:48"},{"sentence":"We legally have to get a picture of.","startTime":"03:48","endTime":"03:50"},{"sentence":"Well, we have to get the license numbers.","startTime":"03:50","endTime":"03:52"},{"sentence":"So sometimes a rep on site at a restaurant will just take a picture of the placard that has their license.","startTime":"03:52","endTime":"03:58"},{"sentence":"If we could get that to then auto populate to the account or to initiate an account setup and add that would be really cool.","startTime":"03:58","endTime":"04:07"},{"sentence":"I don't know how difficult that would be.","startTime":"04:07","endTime":"04:09"},{"sentence":"Let's see.","startTime":"04:11","endTime":"04:11"},{"sentence":"Due to order.","startTime":"04:11","endTime":"04:11"},{"sentence":"Healthy.","startTime":"04:11","endTime":"04:12"},{"sentence":"Yeah, I love all of this.","startTime":"04:12","endTime":"04:14"},{"sentence":"If you dig in here, you'd want to be able to.","startTime":"04:18","endTime":"04:21"},{"sentence":"To pivot to see what the customer's ordering.","startTime":"04:22","endTime":"04:26"},{"sentence":"You know, some of the specifics around the items that they're ordering.","startTime":"04:27","endTime":"04:30"},{"sentence":"When the last time they ordered that item was.","startTime":"04:30","endTime":"04:33"},{"sentence":"Yeah, I think all of that.","startTime":"04:34","endTime":"04:36"},{"sentence":"So digging into each customer and then being able to pivot and get to see the details of all of their different orders.","startTime":"04:36","endTime":"04:43"},{"sentence":"Call plan.","startTime":"04:44","endTime":"04:45"},{"sentence":"This has to be like, probably one of my favorite pieces.","startTime":"04:45","endTime":"04:48"},{"sentence":"If we could execute this, where this could then populate out to whatever calendaring system.","startTime":"04:49","endTime":"04:55"},{"sentence":"So it populates to somebody's.","startTime":"04:55","endTime":"04:59"},{"sentence":"Like we're on Google with our email.","startTime":"04:59","endTime":"05:01"},{"sentence":"If somebody is on Outlook, being able to populate to that as they do it here.","startTime":"05:01","endTime":"05:06"},{"sentence":"So I would see them kind of working on an app on their phone if they're out in the market or on their iPad.","startTime":"05:07","endTime":"05:13"},{"sentence":"And then, you know, that immediately syncing to devices so that if they set something up in the tool, it's also populated outside of whether or not they're in that tool at the time.","startTime":"05:13","endTime":"05:26"},{"sentence":"Let's see.","startTime":"05:27","endTime":"05:27"},{"sentence":"In person visits.","startTime":"05:28","endTime":"05:29"},{"sentence":"This is great.","startTime":"05:29","endTime":"05:30"},{"sentence":"Let's see.","startTime":"05:31","endTime":"05:32"},{"sentence":"So with the call plan, one of the things that we do.","startTime":"05:36","endTime":"05:39"},{"sentence":"I'll just show you real quickly, see if I have one open.","startTime":"05:39","endTime":"05:44"},{"sentence":"So, okay, let's look at Angela's.","startTime":"05:46","endTime":"05:57"},{"sentence":"So this is what we call a Carla.","startTime":"05:57","endTime":"05:59"},{"sentence":"This.","startTime":"06:01","endTime":"06:01"},{"sentence":"It's just a list of accounts.","startTime":"06:01","endTime":"06:03"},{"sentence":"But what they do right now is they have a list of all of their accounts.","startTime":"06:03","endTime":"06:06"},{"sentence":"And then those accounts are categorized by prospect.","startTime":"06:07","endTime":"06:10"},{"sentence":"If they're an account we know of, but we're not working with yet, a target, an account that we know of and we're trying to get them to buy, but they haven't bought yet, and then a current account that's an account that's actively doing business with us.","startTime":"06:10","endTime":"06:23"},{"sentence":"So they can sort here and then however they like or sort by territory and then they can create, what they do is they create a call plan by checking the box.","startTime":"06:23","endTime":"06:34"},{"sentence":"So if this is how they'll say, okay, who am I going to visit next week?","startTime":"06:34","endTime":"06:40"},{"sentence":"So they go through and they do this and then they filter on the checked boxes and that's their list of who they're going to get in touch with each week.","startTime":"06:40","endTime":"06:49"},{"sentence":"And so by requiring that they go through and they do this review of their entire account list once a week and they specifically pick which accounts they're going to try to contact.","startTime":"06:49","endTime":"07:03"},{"sentence":"And then of course they're supposed to put like a three to five word objective, but if we had a proxy for this in the tool, I mean, it would be unbelievably powerful.","startTime":"07:03","endTime":"07:12"},{"sentence":"And then they can go through and just check it off as they go.","startTime":"07:12","endTime":"07:15"},{"sentence":"Which is what we recommend that they do with this, is they either print this off or they go through and update.","startTime":"07:15","endTime":"07:21"},{"sentence":"And so at the end of the week, if they have a call plan that's completely checked off, then they've completed their objectives.","startTime":"07:22","endTime":"07:29"},{"sentence":"And this then is used to populate the calendar.","startTime":"07:31","endTime":"07:34"},{"sentence":"So it's the one piece that fits in between like who's my account list and what's on my calendar.","startTime":"07:35","endTime":"07:42"},{"sentence":"Creating that call plan is the, is bridging those two.","startTime":"07:43","endTime":"07:46"},{"sentence":"And then they could of course just execute what's on their calendar.","startTime":"07:46","endTime":"07:50"},{"sentence":"So yeah, having a proxy for that here and then those objectives and as they action that call plan, turning those into objectives.","startTime":"07:51","endTime":"08:02"},{"sentence":"So if, let's say you had your call plan and it was a list of all of the customers and they go through and click like add activity against the account on that and then that would take them to the page where they can either enter activity or they can speak it into the phone.","startTime":"08:02","endTime":"08:17"},{"sentence":"That would be groundbreaking.","startTime":"08:18","endTime":"08:21"},{"sentence":"Right?","startTime":"08:21","endTime":"08:22"},{"sentence":"Just getting our reps the way that they do it now, honestly, they're taking notes into a notebook and then from that notebook we have to beg and plead them to transcribe it or to just use their iPad and put it directly into the CRM at the time that they're doing it.","startTime":"08:22","endTime":"08:43"},{"sentence":"But usually they either Take it in their notebook and then they go home and then they spend like 30 minutes inputting their notes.","startTime":"08:43","endTime":"08:48"},{"sentence":"And usually they're really crappy notes because they're tired.","startTime":"08:48","endTime":"08:51"},{"sentence":"It's the end of the day.","startTime":"08:51","endTime":"08:52"},{"sentence":"So if there's a way for them to quickly and easily get those notes into here, it would be ideal.","startTime":"08:53","endTime":"09:01"},{"sentence":"Samples.","startTime":"09:02","endTime":"09:03"},{"sentence":"I haven't fully processed how we would use this quite yet, but I think probably like we'll have to go through the operations piece.","startTime":"09:03","endTime":"09:14"},{"sentence":"But knowing what samples that they have pulled and being able to pull those out and apply them to an account.","startTime":"09:14","endTime":"09:22"},{"sentence":"So let's say you've pulled in the last, I don't know, three weeks, different wines.","startTime":"09:23","endTime":"09:28"},{"sentence":"You can grab the wine that you've pulled and maybe this is just a function of the portfolio rather than having to have it on here, but you can grab a wine and just apply it to an account with a couple of feedback boxes so that they don't even have to input too much.","startTime":"09:28","endTime":"09:43"},{"sentence":"They can put some custom information in.","startTime":"09:44","endTime":"09:46"},{"sentence":"But having like some options that are kind of pre populated would be really functional for them.","startTime":"09:49","endTime":"09:56"},{"sentence":"Thinking like salespeople, they want to get this admin stuff done as quickly as possible.","startTime":"09:56","endTime":"10:01"},{"sentence":"They just generally don't have an appetite for it.","startTime":"10:01","endTime":"10:04"},{"sentence":"And we'll short circuit and skip stuff if it isn't easy.","startTime":"10:05","endTime":"10:09"},{"sentence":"And then the sampling piece, being able to look at some metrics like which samples created the most sales.","startTime":"10:10","endTime":"10:20"},{"sentence":"So after you pull the sample products or after you logged sample order sample data into the system against different accounts, which one had the best performance?","startTime":"10:20","endTime":"10:32"},{"sentence":"And that's obviously a huge thing for us to be able to look at the management level is to say of all the samples that we used, which samples had the highest hit rate?","startTime":"10:33","endTime":"10:43"},{"sentence":"Which samples are being pulled most regularly?","startTime":"10:44","endTime":"10:46"},{"sentence":"How many customers are being pasted on each sample?","startTime":"10:47","endTime":"10:51"},{"sentence":"This is all stuff that we can share with us, with suppliers and the suppliers are going to want to know the orders page.","startTime":"10:51","endTime":"11:03"},{"sentence":"So we'd have to think through here.","startTime":"11:03","endTime":"11:06"},{"sentence":"Right now there's just one long queue in our system that we're using.","startTime":"11:07","endTime":"11:11"},{"sentence":"So here's what the orders page looks like.","startTime":"11:11","endTime":"11:13"},{"sentence":"So it's just one long queue.","startTime":"11:14","endTime":"11:16"},{"sentence":"There really isn't a need for everyone to get to see all of the orders.","startTime":"11:16","endTime":"11:20"},{"sentence":"The only folks that really need to see everything is management and operations.","startTime":"11:20","endTime":"11:26"},{"sentence":"Which gets me to the next piece of this, which is we need to have a piece that is about, whoops, we're going to get infinity there.","startTime":"11:26","endTime":"11:35"},{"sentence":"Where are we?","startTime":"11:37","endTime":"11:38"},{"sentence":"So we need to have a piece that is just for operations.","startTime":"11:40","endTime":"11:42"},{"sentence":"So our warehouse should be able to take anything that's marked as ready for delivery or sent somehow transmitted somehow to operations to say, hey, this order is ready.","startTime":"11:43","endTime":"11:56"},{"sentence":"You can go ahead and pick it right now.","startTime":"11:56","endTime":"11:58"},{"sentence":"What our operations team does is they do an export out of how of all of the items.","startTime":"11:59","endTime":"12:06"},{"sentence":"And each item has to have a warehouse location designation on it.","startTime":"12:07","endTime":"12:13"},{"sentence":"And so that designation instead of having all the orders sorted by customer, because this 17,000 square foot warehouse, one order might have something over here and something here.","startTime":"12:14","endTime":"12:27"},{"sentence":"Well, they pick by row.","startTime":"12:27","endTime":"12:29"},{"sentence":"And so what we do is we take that export out of the CRM for everything that's ready to be picked that the reps have said this is good to go, this can be picked and then that's sorted and it's in order of both aisle.","startTime":"12:29","endTime":"12:47"},{"sentence":"And then as you go down the aisle, all of the items are sorted on a pick sheet in that order.","startTime":"12:47","endTime":"12:54"},{"sentence":"So that our pickers can just walk down the aisle and pick as they go, rather than having to go here and then back here and then over here.","startTime":"12:55","endTime":"13:03"},{"sentence":"So the operations piece and how sales informs it is important.","startTime":"13:03","endTime":"13:10"},{"sentence":"So when it's time to build that out, let me know what the best way to inform you kind of how we work.","startTime":"13:10","endTime":"13:19"},{"sentence":"And I think it's going to be relevant for pretty much everyone and different warehouses.","startTime":"13:21","endTime":"13:25"},{"sentence":"But I can have Christy do a loom or something to show you what our team does.","startTime":"13:26","endTime":"13:32"},{"sentence":"Then the next piece of that is on a given day when our operations team has all of the orders and one side of the team is picking everything, the other part of the team is routing it.","startTime":"13:32","endTime":"13:47"},{"sentence":"So being able to feed this in the routing software right now we use Azuga routes by Azuga.","startTime":"13:47","endTime":"13:55"},{"sentence":"And so having all of this feed into Azuga so that we can then start building right now we do it based on an export.","startTime":"13:55","endTime":"14:04"},{"sentence":"So it's an export to a CSV.","startTime":"14:04","endTime":"14:06"},{"sentence":"And then we upload that and Azuga knows all of the accounts, matches them up and we go through in Ralph.","startTime":"14:06","endTime":"14:12"},{"sentence":"And then at the end of that, our ops guy takes a picture of the routes just in spreadsheet form and I'll show you what that looks like.","startTime":"14:13","endTime":"14:22"},{"sentence":"This is what that looks like.","startTime":"14:32","endTime":"14:34"},{"sentence":"So he has each one of the routes and which driver has it and then which customer is going to get a delivery.","startTime":"14:34","endTime":"14:44"},{"sentence":"And so this allows our sales team, when they get a call from a customer and they're like, hey, when's my delivery coming?","startTime":"14:44","endTime":"14:50"},{"sentence":"And they can have already looked at this and say, yep, I know the truck's on the Way it looks like your Delivery scheduled for 12:36pm so having access to that for the sales team so that they can see when the trucks have left or the night before.","startTime":"14:50","endTime":"15:08"},{"sentence":"Once routes have been published, they can go through, look at the routes and they can tell their customers, hey, by the way, your order is going to be there roughly such and such time.","startTime":"15:08","endTime":"15:16"},{"sentence":"So they want to, we want them to be able to have access to that information.","startTime":"15:16","endTime":"15:20"},{"sentence":"This would be amazing.","startTime":"15:22","endTime":"15:23"},{"sentence":"And I think having the catalog accessible to suppliers so that suppliers can log in and just for their brands, they can make updates so they can add photos, they can add technical details about the lines, anything that they want, they have the ability to influence it.","startTime":"15:23","endTime":"15:46"},{"sentence":"And then of course our team can as well.","startTime":"15:47","endTime":"15:49"},{"sentence":"This is really good.","startTime":"15:50","endTime":"15:51"},{"sentence":"And then we would have, yeah, pricing, obviously that's easy to build in the ability to build a tech sheet or I'm sorry, a sales sheet off of this.","startTime":"15:51","endTime":"16:04"},{"sentence":"So to select, let's say I'm a rep that's going to go out with seven different wines in an hour and I want to real quickly put all those wines onto a tech sheet.","startTime":"16:04","endTime":"16:13"},{"sentence":"Here's what it looks like now.","startTime":"16:13","endTime":"16:15"},{"sentence":"Sorry, that's tech sheets.","startTime":"16:16","endTime":"16:19"},{"sentence":"So we'll grab Honey lunch and we'll grab this vintage of this.","startTime":"16:20","endTime":"16:29"},{"sentence":"Okay.","startTime":"16:29","endTime":"16:30"},{"sentence":"And I want multiple items per page and I want this particular price list and then I generate the PDF and it takes it and spits it out and gives me my different pricing on it and all the information that's associated with that particular one that we deem worthy for these sales sheets.","startTime":"16:30","endTime":"16:54"},{"sentence":"So sometimes you'll have like a page, a full page worth of information online, but you only want like some of it to go onto the sales sheet.","startTime":"16:54","endTime":"17:02"},{"sentence":"So having the functionality to be able to build that out is key.","startTime":"17:02","endTime":"17:06"},{"sentence":"Browse catalog.","startTime":"17:10","endTime":"17:11"},{"sentence":"Okay, I'm not sure where this is headed, but okay, next order.","startTime":"17:12","endTime":"17:22"},{"sentence":"So okay, manager, like the dashboard, one of the things that would be helpful I think, and maybe this goes on here or maybe this goes on the call plan page is being able to see a map with all the accounts on it and even possibly seeing like a heat map where the sales are.","startTime":"17:22","endTime":"17:52"},{"sentence":"So maybe the manager can get to see, you know, what's growing where sales are more stagnant and the way a sales manager will use that or one of the ways is to determine where they need to be spending their time.","startTime":"17:52","endTime":"18:05"},{"sentence":"So when they want to go through and schedule themselves to go visit new markets, they get to see real quickly.","startTime":"18:05","endTime":"18:14"},{"sentence":"Here's where your most growth is.","startTime":"18:16","endTime":"18:18"},{"sentence":"What Territories are highest performing, maybe which ones need a little bit of help.","startTime":"18:18","endTime":"18:23"},{"sentence":"And then a rep would see that to help them schedule and visualize what customers they could reach out to in a given area.","startTime":"18:23","endTime":"18:31"},{"sentence":"Or they could select a box and say I'm planning to go to this particular segment of my territory, who's around there or who are the closest accounts.","startTime":"18:31","endTime":"18:39"},{"sentence":"That sort of a thing.","startTime":"18:39","endTime":"18:40"},{"sentence":"Admin I haven't gone through this one yet, so I don't have as many thoughts to share here.","startTime":"18:42","endTime":"18:51"},{"sentence":"Supplier page obviously would be nice to have.","startTime":"18:57","endTime":"18:59"},{"sentence":"Oh this reminds me.","startTime":"19:02","endTime":"19:03"},{"sentence":"So one of the other things that would be really useful is we is integrating having an email list for each rep and having the ability to create one master email list or segments of email lists that can then integrate into mailchimp for building mailchimp emails.","startTime":"19:03","endTime":"19:23"},{"sentence":"The other thing I was thinking as I was going through this is if we could go through dashboard customers.","startTime":"19:23","endTime":"19:32"},{"sentence":"Changed the view on myself.","startTime":"19:36","endTime":"19:37"},{"sentence":"I'm not sure how to get back to it, but where's my inventory of products?","startTime":"19:37","endTime":"19:43"},{"sentence":"So if I can choose products, let's say I want my sales manager to do an email on Thanksgiving wines and I say here are the wines he can go through.","startTime":"19:43","endTime":"19:52"},{"sentence":"Pick the wines which presumably would already have an image of the wine or several that they could choose and have write ups on the wines and have that populate to mailchimp in some way to help foster the production of an email.","startTime":"19:52","endTime":"20:08"},{"sentence":"I know it's not going to create the email for us, but at least get things started.","startTime":"20:08","endTime":"20:11"},{"sentence":"And then the things that we always replicate is we have to enter pricing, we have to grab images of labels or images of bottles, we're going to have some technical or tasty notes on the wines.","startTime":"20:12","endTime":"20:23"},{"sentence":"That stuff is all resident already in our CRM, but getting that from here to here is quite manual and it probably shouldn't be.","startTime":"20:23","endTime":"20:32"},{"sentence":"Okay.","startTime":"20:34","endTime":"20:35"},{"sentence":"Yeah, I think for the most part that's some of my initial feedback and I would love to set up a schedule if we can to go through a little bit like how this is being built and what next steps are and what our timeline is looking like and then I'll continue to source some.","startTime":"20:35","endTime":"20:56"},{"sentence":"Hey, these would be really nice to have but this is super exciting and obviously I don't know how much work has gone into this, but it sure seems like a lot of work has gone into this and it's looking quite sa.","startTime":"20:56","endTime":"22:10"}]